In [85]:
import pandas as pd
import seaborn as sns 
import matplotlib.pyplot as plt
%matplotlib inline 
import sklearn

In [86]:
train_data = pd.read_csv("/Users/rajkumarnattamaisubramanian/Downloads/Kaggle ML Competitions/titanic/train.csv")

In [87]:
train_data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [88]:
test_data = pd.read_csv("/Users/rajkumarnattamaisubramanian/Downloads/Kaggle ML Competitions/titanic/test.csv")

In [89]:
test_data.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [90]:
train_data.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [91]:
train_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [92]:
train_data.sample()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
870,871,0,3,"Balkic, Mr. Cerin",male,26.0,0,0,349248,7.8958,NaN,S

In [93]:
from sklearn.ensemble import RandomForestClassifier

y = train_data.Survived
features = ['Pclass','Sex','SibSp','Parch']
X = pd.get_dummies(train_data[features])

model = RandomForestClassifier(n_estimators = 17, max_depth = 4, random_state = 1, bootstrap = True, max_features = 'sqrt',min_samples_leaf = 2, min_samples_split = 5)

In [94]:
model.fit(X,y)

RandomForestClassifier(max_depth=4, max_features='sqrt', min_samples_leaf=2,
                       min_samples_split=5, n_estimators=17, random_state=1)

In [95]:
train_y_predict = model.predict(X)

In [96]:
from sklearn.metrics import accuracy_score
accuracy_score(train_y_predict,y)

0.8114478114478114

In [97]:
X_test = pd.get_dummies(test_data[features])
X_test

     Pclass  SibSp  Parch  Sex_female  Sex_male
0         3      0      0           0         1
1         3      1      0           1         0
2         2      0      0           0         1
3         3      0      0           0         1
4         3      1      1           1         0
..      ...    ...    ...         ...       ...
413       3      0      0           0         1
414       1      0      0           1         0
415       3      0      0           0         1
416       3      0      0           0         1
417       3      1      1           0         1

[418 rows x 5 columns]

In [98]:
predictions = model.predict(X_test)

In [99]:
df2 = train_data[['Survived','Age']]

In [100]:
df3 = df2[df2['Survived'] == 1]

In [101]:
train_data.Age.unique()

array([22.  , 38.  , 26.  , 35.  ,   nan, 54.  ,  2.  , 27.  , 14.  ,
        4.  , 58.  , 20.  , 39.  , 55.  , 31.  , 34.  , 15.  , 28.  ,
        8.  , 19.  , 40.  , 66.  , 42.  , 21.  , 18.  ,  3.  ,  7.  ,
       49.  , 29.  , 65.  , 28.5 ,  5.  , 11.  , 45.  , 17.  , 32.  ,
       16.  , 25.  ,  0.83, 30.  , 33.  , 23.  , 24.  , 46.  , 59.  ,
       71.  , 37.  , 47.  , 14.5 , 70.5 , 32.5 , 12.  ,  9.  , 36.5 ,
       51.  , 55.5 , 40.5 , 44.  ,  1.  , 61.  , 56.  , 50.  , 36.  ,
       45.5 , 20.5 , 62.  , 41.  , 52.  , 63.  , 23.5 ,  0.92, 43.  ,
       60.  , 10.  , 64.  , 13.  , 48.  ,  0.75, 53.  , 57.  , 80.  ,
       70.  , 24.5 ,  6.  ,  0.67, 30.5 ,  0.42, 34.5 , 74.  ])

In [102]:
train_data1 = train_data[train_data['Survived'] == 1]

In [103]:
train_data1.shape

(342, 12)

In [104]:
train_data2 = train_data[train_data['Survived'] == 0]
train_data2.shape

(549, 12)

In [105]:
print(549/891)

0.6161616161616161

In [106]:
train_data1.Pclass.value_counts()

1    136
3    119
2     87
Name: Pclass, dtype: int64

In [107]:
train_data2.Pclass.value_counts()

3    372
2     97
1     80
Name: Pclass, dtype: int64

In [108]:
train_data.Pclass.value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [109]:
print(136/216)

0.6296296296296297

In [110]:
print(87/184)

0.47282608695652173

In [111]:
print(119/491)

0.24236252545824846

In [112]:
train_data1_1 = train_data1[train_data1['Pclass'] == 1]

In [113]:
train_data1_1.Sex.value_counts(normalize=True)

female    0.669118
male      0.330882
Name: Sex, dtype: float64

In [114]:
train_data2_1 = train_data2[train_data2['Pclass'] == 1]

In [115]:
train_data2_1.Sex.value_counts(normalize=True)

male      0.9625
female    0.0375
Name: Sex, dtype: float64

In [116]:
train_data1_2 = train_data1[train_data1['Pclass'] == 2]
train_data1_2.Sex.value_counts(normalize=True)

female    0.804598
male      0.195402
Name: Sex, dtype: float64

In [117]:
train_data1_3 = train_data1[train_data1['Pclass'] == 3]
train_data1_3.Sex.value_counts(normalize=True)

female    0.605042
male      0.394958
Name: Sex, dtype: float64

In [118]:
train_data2_2 = train_data2[train_data2['Pclass'] == 2]
train_data2_2.Sex.value_counts(normalize=True)

male      0.938144
female    0.061856
Name: Sex, dtype: float64

In [119]:
train_data2_3 = train_data2[train_data2['Pclass'] == 3]
train_data2_3.Sex.value_counts(normalize=True)

male      0.806452
female    0.193548
Name: Sex, dtype: float64

In [120]:
train_data.Pclass.corr(train_data.Survived)

-0.3384810359610153

In [121]:
train_data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [122]:
train_data1_1_female = train_data1_1.loc[train_data1_1.Sex == "female"]['Age']

In [123]:
train_data1_1_female.describe()

count    82.000000
mean     34.939024
std      13.223014
min      14.000000
25%      23.250000
50%      35.000000
75%      44.000000
max      63.000000
Name: Age, dtype: float64

In [124]:
train_data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q